<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the Backgrounds installer package and renames the package.</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.pkg.backgrounds</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Backgrounds</string>
         <key>SOFTWARETITLE</key>
         <string>Backgrounds</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.download.backgrounds</string>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
         <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
               <key>source_pkg</key>
               <string>%pathname%</string>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%SOFTWARETITLE%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
