<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the latest version of Sophos Anti-Virus Home Edition.</string>
	<key>Identifier</key>
	<string>com.github.rtrouton.install.SophosAntiVirusHomeEdition</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SophosAntiVirusHomeEdition</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.SophosAntiVirusHomeEdition</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>