<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Citrix Workspace disk image, extracts the installer package and imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.github.rtrouton.jss.citrixworkspace</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Virtualization</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Citrix Workspace</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Citrix Workspace is the easy-to-install client software that provides access to your Citrix XenDesktop and XenApp installations.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%RECIPE_DIR%/CitrixWorkspace.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.citrixworkspace</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>groups</key>
				<array>
				    <dict>
				        <key>name</key>
				        <string>%GROUP_NAME%</string>
				        <key>smart</key>
				        <true/>
				        <key>template_path</key>
				        <string>%GROUP_TEMPLATE%</string>
				    </dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
