<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent pkg recipe to download latest DbVisualizer and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.rtrouton.jss.dbvisualizer</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>DbVisualizer</string>
            <key>CATEGORY</key>
            <string>Database Tools</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/DbVisualizer.png</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>DESCRIPTION</key>
            <string>DbVisualizer is a database management and analysis tool for all major databases (including Oracle, SQL Server, DB2, Sybase, MySQL, and SQLite.) It is designed to help developers and database administrators by providing a tool for the development and maintenance of databases.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.pkg.dbvisualizer</string>
        <key>Process</key>
        <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>warning_message</key>
               <string>The .jss recipes in the rtrouton-recipes repository will stop working in a future version of Jamf planned for late 2022. Please consider switching your JSSImporter workflows to JamfUploader instead. Details: https://grahamrpugh.com/2022/02/16/jssimporter-jamf-pro-api-token-auth.html</string>
            </dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
         </dict>
         <dict>
			<key>Arguments</key>                
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
