<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent recipe to download the latest version of GitHub Desktop, build an installer package and then upload the package to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.rtrouton.jss.GitHubDesktop</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>GitHub Desktop</string>
            <key>JSS_INVENTORY_NAME</key>
            <string>GitHub Desktop.app</string>
            <key>CATEGORY</key>
            <string>Development</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <!--PlistReader w/o variable injection in AutoPkg requires this-->
            <key>version</key>
            <string/>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/GitHubDesktop.png</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/GitHubDesktopSmartGroupTemplate.xml</string>
            <key>DESCRIPTION</key>
            <string>GitHub Desktop is an application that enables you to work with projects hosted on GitHub and GitHub Enterprise.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.homebysix.pkg.GitHubDesktop</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>jss_inventory_name</key>
                    <string>%JSS_INVENTORY_NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>extension_attributes</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>GitHubDesktopVersion</string>
                            <key>ext_attribute_path</key>
                            <string>%RECIPE_DIR%/GitHubDesktopExtensionAttribute.xml</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
