<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Microsoft's Intune Company Portal installer package, renames the package to match our naming standard, then uploads to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.rtrouton.jss.MicrosoftIntuneCompanyPortal</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Microsoft Intune Company Portal</string>
            <key>CATEGORY</key>
            <string>Apps</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>DESCRIPTION</key>
            <string>Install the latest version of Microsoft's Intune Company Portal.</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/MicrosoftIntuneCompanyPortal.png</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.pkg.MicrosoftIntuneCompanyPortal</string>
        <key>Process</key>
        <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>warning_message</key>
               <string>The .jss recipes in the rtrouton-recipes repository will stop working in a future version of Jamf planned for late 2022. Please consider switching your JSSImporter workflows to JamfUploader instead. Details: https://grahamrpugh.com/2022/02/16/jssimporter-jamf-pro-api-token-auth.html</string>
            </dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
         </dict>
         <dict>
			<key>Arguments</key>                
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>jss_inventory_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>