<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Uses parent download recipe to download the latest SapMachine Manager installer package and installs it.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.install.SapMachineManager</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>SapMachine Manager</string>
         <key>VENDOR</key>
         <string>SAP</string>
         <key>SOFTWARETITLE1</key>
         <string>SapMachine</string>
         <key>SOFTWARETITLE2</key>
         <string>Manager</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.rtrouton.pkg.SapMachineManager</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>Installer</string>
         </dict>
      </array>
   </dict>
</plist>