<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Adobe's Creative Cloud Installer and builds an installer package which installs the correct Creative Cloud for your Mac's processor.</string>
	<key>Identifier</key>
	<string>com.github.rtrouton.pkg.AdobeCreativeCloudInstallerUniversal</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Creative Cloud Installer</string>
		<key>VENDOR</key>
		<string>Adobe</string>
		<key>SOFTWARETITLE</key>
		<string>Creative Cloud Installer</string>
		<key>NAMEWITHOUTSPACES</key>
		<string>CreativeCloudInstaller</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.download.AdobeCreativeCloudInstallerUniversal</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Intel_Package/pkgroot</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Intel_Package/Scripts</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>xml_path</key>
				<string>%RECIPE_CACHE_DIR%/Intel/ApplicationInfo.xml</string>
				<key>elements</key>
				<array>
					<dict>
						<key>xpath</key>
						<string>version</string>
						<key>text</key>
						<string>version</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>XMLReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/downloads/intel/*.dmg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%found_filename%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Intel_Package/Scripts/%VENDOR%%NAMEWITHOUTSPACES%-%version%.dmg</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Intel_Package/Scripts/postinstall</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_content</key>
				<string>#!/bin/bash
				
# Determine working directory
installDir=$(dirname $0)
dmg=("${installDir}"/*\.dmg)

# Mount the disk image to /Volumes
mountResult=$(/usr/bin/hdiutil attach "${dmg}" -nobrowse -noverify -noautoopen)
mountPoint=$(/bin/echo "${mountResult}" | /usr/bin/grep Volumes | /usr/bin/awk '{print substr($0, index($0,$3))}')

# Install the software
"${mountPoint}/Install.app/Contents/MacOS/Install" --mode=silent

# Get the exit code so we can fail properly
exitcode=$?

# Unmount the disk image from /Volumes
/usr/bin/hdiutil detach "${mountPoint}"

# Exit according to whether the install succeeded or not
exit "${exitcode}"
</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/Intel_Package/pkgroot</string>
					<key>pkgname</key>
					<string>%VENDOR%%NAMEWITHOUTSPACES%-Intel-%version%</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>id</key>
					<string>com.adobe.AdobeCreativeCloudInstallerIntel.pkg</string>
					<key>version</key>
					<string>%version%</string>
					<key>scripts</key>
					<string>Intel_Package/Scripts</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/AppleSilicon_Package/pkgroot</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/AppleSilicon_Package/Scripts</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>xml_path</key>
				<string>%RECIPE_CACHE_DIR%/AppleSilicon/ApplicationInfo.xml</string>
				<key>elements</key>
				<array>
					<dict>
						<key>xpath</key>
						<string>version</string>
						<key>text</key>
						<string>version</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>XMLReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/downloads/applesilicon/*.dmg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%found_filename%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/AppleSilicon_Package/Scripts/%VENDOR%%NAMEWITHOUTSPACES%-%version%.dmg</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/AppleSilicon_Package/Scripts/postinstall</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_content</key>
				<string>#!/bin/bash
				
# Determine working directory
installDir=$(dirname $0)
dmg=("${installDir}"/*\.dmg)

# Mount the disk image to /Volumes
mountResult=$(/usr/bin/hdiutil attach "${dmg}" -nobrowse -noverify -noautoopen)
mountPoint=$(/bin/echo "${mountResult}" | /usr/bin/grep Volumes | /usr/bin/awk '{print substr($0, index($0,$3))}')

# Install the software
"${mountPoint}/Install.app/Contents/MacOS/Install" --mode=silent

# Get the exit code so we can fail properly
exitcode=$?

# Unmount the disk image from /Volumes
/usr/bin/hdiutil detach "${mountPoint}"

# Exit according to whether the install succeeded or not
exit "${exitcode}"
</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/AppleSilicon_Package/pkgroot</string>
					<key>pkgname</key>
					<string>%VENDOR%%NAMEWITHOUTSPACES%-AppleSilicon-%version%</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>id</key>
					<string>com.adobe.AdobeCreativeCloudInstallerAppleSilicon.pkg</string>
					<key>version</key>
					<string>%version%</string>
					<key>scripts</key>
					<string>AppleSilicon_Package/Scripts</string>
				</dict>
			</dict>
		</dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/Universal/Scripts</string>
               <key>pkgdirs</key>
               <dict />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/Universal/pkgroot</string>
               <key>pkgdirs</key>
               <dict />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
               <key>source</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%%NAMEWITHOUTSPACES%-AppleSilicon-%version%.pkg</string>
               <key>target</key>
               <string>%RECIPE_CACHE_DIR%/Universal/Scripts/%VENDOR%%NAMEWITHOUTSPACES%-AppleSilicon-%version%.pkg</string>
               <key>overwrite</key>
               <false />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
               <key>source</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%%NAMEWITHOUTSPACES%-Intel-%version%.pkg</string>
               <key>target</key>
               <string>%RECIPE_CACHE_DIR%/Universal/Scripts/%VENDOR%%NAMEWITHOUTSPACES%-Intel-%version%.pkg</string>
               <key>overwrite</key>
               <false />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
               <key>file_path</key>
               <string>%RECIPE_CACHE_DIR%/Universal/Scripts/preinstall</string>
               <key>file_mode</key>
               <string>0755</string>
               <key>file_content</key>
               <string>#!/bin/bash

# Determine working directory

installDir=$(dirname $0)

# Identify installer package names

Intel_package="%VENDOR%%NAMEWITHOUTSPACES%-Intel-%version%.pkg"
Apple_Silicon_package="%VENDOR%%NAMEWITHOUTSPACES%-AppleSilicon-%version%.pkg"

# Determine if this Mac has an Intel or Apple Silicon processor

processor=$(/usr/sbin/sysctl -n machdep.cpu.brand_string | grep -o "Intel")

if [[ -n "$processor" ]]; then

/usr/sbin/installer -pkg "$Intel_package" -target "$3"

else

/usr/sbin/installer -pkg "$Apple_Silicon_package" -target "$3"

fi

exit 0</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_request</key>
               <dict>
                  <key>pkgname</key>
                  <string>%VENDOR%%NAMEWITHOUTSPACES%-Universal-%version%</string>
                  <key>version</key>
                  <string>%version%</string>
                  <key>id</key>
                  <string>com.adobe.AdobeCreativeCloudInstallerUniversal</string>
                  <key>scripts</key>
                  <string>%RECIPE_CACHE_DIR%/Universal/Scripts</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
               </dict>
            </dict>
         </dict>

		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/AppleSilicon</string>
					<string>%RECIPE_CACHE_DIR%/AppleSilicon_Package</string>
					<string>%RECIPE_CACHE_DIR%/Intel</string>
					<string>%RECIPE_CACHE_DIR%/Intel_Package</string>
					<string>%RECIPE_CACHE_DIR%/Universal</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
