<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Download recipe for Fiji, which downloads a zip file containing the latest stable version of Fiji. Fiji is an image processing package and can be described as a distribution of ImageJ (and ImageJ2) together with Java, Java3D and a lot of plugins organized into a coherent menu structure.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.Fiji</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Fiji</string>
         <key>SOFTWARETITLE</key>
         <string>Fiji</string>
         <key>DOWNLOAD_URL</key>
         <string>https://downloads.imagej.net/fiji/latest/fiji-latest-macos64-jdk.zip</string>
      </dict>
      <key>MinimumVersion</key>
      <string>0.2.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
               <key>url</key>
               <string>https://maven.scijava.org/content/groups/public/sc/fiji/fiji/maven-metadata.xml</string>
               <key>re_pattern</key>
               <string>release&gt;(.*)&lt;\/release</string>
               <key>result_output_var_name</key>
               <string>version</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
               <key>url</key>
               <string>%DOWNLOAD_URL%</string>
               <key>filename</key>
               <string>%SOFTWARETITLE%-%version%.zip</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
      </array>
   </dict>
</plist>