<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of iMazing's Profile Editor.</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.download.iMazingProfileEditor</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>iMazing Profile Editor</string>
        <key>VENDOR</key>
        <string>iMazing</string>
        <key>SOFTWARETITLE1</key>
        <string>Profile</string>
        <key>SOFTWARETITLE2</key>
        <string>Editor</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://downloads.imazing.com/com.DigiDNA.iMazingProfileEditorMac.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
         <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/iMazing Profile Editor.app</string>
                <key>requirement</key>
                <string>identifier "com.DigiDNA.iMazingProfileEditorMac" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J5PR93692Y</string>
            </dict>
         </dict>
    </array>
</dict>
</plist>