<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Rectangle and creates an installer package.</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.pkg.Rectangle</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Rectangle</string>
         <key>SOFTWARETITLE</key>
         <string>Rectangle</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Rectangle</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>version</key>
                <string>%version%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%SOFTWARETITLE%_%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
