<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for MeisterTask, which downloads an installer package for the latest version of MeisterTask.</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.download.MeisterTask</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MeisterTask</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.meistertask.com/files/MeisterTask_osx.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.8.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/MeisterTask.dmg/MeisterTask.app</string>
                <key>requirement</key>
                  <string>identifier "com.meisterlabs.meistertask.desktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4MX957DLH9"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
