<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release of SapMachine Java 11 JDK for Apple Silicon from the SapMachine release page on Github: https://github.com/SAP/SapMachine/releases</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.SapMachineAppleSiliconJDK11</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>SapMachine</string>
         <key>VENDOR</key>
         <string>SAP</string>
         <key>SOFTWARETITLE</key>
         <string>SapMachine</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
               <key>asset_regex</key>
               <string>sapmachine-jdk-11[\S]+\_macos-aarch64_bin.dmg</string>
               <key>github_repo</key>
               <string>sap/sapmachine</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%pathname%/sapmachine-jdk-*.jdk</string>
               <key>requirement</key>
               <string>identifier "com.sap.openjdk.jdk" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7R5ZEU67FQ"</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>
