<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of SD Notary and packages it for installation.</string>
	<key>Identifier</key>
	<string>com.github.rtrouton.pkg.sdnotary</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SD Notary</string>
		<key>VENDOR</key>
		<string>Late Night Software</string>
		<key>SOFTWARETITLE</key>
		<string>SD Notary</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.download.sdnotary</string>
	<key>Process</key>
	<array>
		<dict>
		   <key>Processor</key>
		   <string>Versioner</string>
		   <key>Arguments</key>
		   <dict>
		      <key>input_plist_path</key>
		      <string>%RECIPE_CACHE_DIR%/%VENDOR%/SD Notary.app/Contents/Info.plist</string>
		      <key>plist_version_key</key>
		      <string>CFBundleShortVersionString</string>
		   </dict>
		</dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/pkgroot</string>
               <key>pkgdirs</key>
               <dict>
                  <key>Applications</key>
                  <string>0775</string>
               </dict>
            </dict>
         </dict>
		<dict>
		   <key>Processor</key>
		   <string>Unarchiver</string>
		   <key>Arguments</key>
		   <dict>
		      <key>archive_path</key>
		      <string>%pathname%</string>
		      <key>destination_path</key>
		      <string>%pkgroot%/Applications</string>
		      <key>purge_destination</key>
		      <true />
		   </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgname</key>
					<string>%SOFTWARETITLE%-%version%</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>id</key>
					<string>com.latenightsw.Script-Notary.pkg</string>
					<key>version</key>
					<string>%version%</string>
					<key>chown</key>
					<array>
					    <dict>
					        <key>path</key>
					        <string>Applications</string>
					        <key>user</key>
					        <string>root</string>
					        <key>group</key>
					        <string>admin</string>
					    </dict>
					</array>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%VENDOR%</string>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>