<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of SD Notary.</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.download.sdnotary</string>
    <key>Input</key>
    <dict>
		<key>NAME</key>
		<string>SD Notary</string>
		<key>VENDOR</key>
		<string>Late Night Software</string>
        <key>SEARCH_URL</key>
        <string>https://latenightsw.com/sd-notary-notarizing-made-easy/</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;https.*?SDNotary.*?\.zip)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%VENDOR%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>Versioner</string>
           <key>Arguments</key>
           <dict>
              <key>input_plist_path</key>
              <string>%RECIPE_CACHE_DIR%/%VENDOR%/SD Notary.app/Contents/Info.plist</string>
              <key>plist_version_key</key>
              <string>CFBundleShortVersionString</string>
           </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%VENDOR%/SD Notary.app</string>
                <key>requirement</key>
                <string>identifier "com.latenightsw.Script-Notary" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Z7S6X96M3X</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
