<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release of jq for Intel from the jq release page on Github: https://github.com/jqlang/jq/releases</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.JQIntel</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>jq</string>
         <key>VENDOR</key>
         <string>jqlang</string>
         <key>SOFTWARETITLE</key>
         <string>jq</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
               <key>asset_regex</key>
               <string>jq-macos-amd64</string>
               <key>github_repo</key>
               <string>jqlang/jq</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
         </dict>
      </array>
   </dict>
</plist>