<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release version of jq for Intel and builds an installer package.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.pkg.JQIntel</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>jq</string>
         <key>VENDOR</key>
         <string>jqlang</string>
         <key>SOFTWARETITLE</key>
         <string>jq</string>
		<key>VERSION_SPLIT_ON</key>
		<string>-</string>
      </dict>
      <key>ParentRecipe</key>
      <string>com.github.rtrouton.download.JQIntel</string>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
			<key>Arguments</key>
			<dict>
				<key>index</key>
				<integer>1</integer>
				<key>split_on</key>
				<string>%VERSION_SPLIT_ON%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/Intel/pkgroot</string>
               <key>pkgdirs</key>
               <dict>
                  <key>usr</key>
                  <string>0755</string>
                  <key>usr/local</key>
                  <string>0755</string>
                  <key>usr/local/bin</key>
                  <string>0755</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/downloads/*jq-macos-amd64</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
               <key>source_path</key>
               <string>%found_filename%</string>
               <key>destination_path</key>
               <string>%pkgroot%/usr/local/bin/jq</string>
               <key>overwrite</key>
               <true />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_request</key>
               <dict>
                  <key>pkgname</key>
                  <string>%VENDOR%-%SOFTWARETITLE%-x8664-%version%</string>
                  <key>version</key>
                  <string>%version%</string>
                  <key>id</key>
                  <string>org.jqlang.jq.x8664.%version%</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
                  <key>chown</key>
                  <array>
                     <dict>
                        <key>path</key>
                        <string>usr</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                     <dict>
                        <key>path</key>
                        <string>usr/local</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                     <dict>
                        <key>path</key>
                        <string>usr/local/bin</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                     <dict>
                        <key>path</key>
                        <string>usr/local/bin/jq</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                        <key>mode</key>
                        <string>0755</string>
                     </dict>
                  </array>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/Intel</string>
               </array>
            </dict>
         </dict>
      </array>
   </dict>
</plist>