<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release versions of jq for Intel and Apple Silicon and builds an installer package.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.pkg.JQUniversal</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>jq</string>
         <key>VENDOR</key>
         <string>jqlang</string>
         <key>SOFTWARETITLE</key>
         <string>jq</string>
		<key>VERSION_SPLIT_ON</key>
		<string>-</string>
      </dict>
      <key>ParentRecipe</key>
      <string>com.github.rtrouton.download.JQUniversal</string>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
			<key>Arguments</key>
			<dict>
				<key>index</key>
				<integer>1</integer>
				<key>split_on</key>
				<string>%VERSION_SPLIT_ON%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/Intel/pkgroot</string>
               <key>pkgdirs</key>
               <dict>
                  <key>usr</key>
                  <string>0755</string>
                  <key>usr/local</key>
                  <string>0755</string>
                  <key>usr/local/bin</key>
                  <string>0755</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/downloads/*jq-macos-amd64</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
               <key>source_path</key>
               <string>%found_filename%</string>
               <key>destination_path</key>
               <string>%pkgroot%/usr/local/bin/jq</string>
               <key>overwrite</key>
               <true />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_request</key>
               <dict>
                  <key>pkgname</key>
                  <string>%VENDOR%-%SOFTWARETITLE%-x8664-%version%</string>
                  <key>version</key>
                  <string>%version%</string>
                  <key>id</key>
                  <string>org.jqlang.jq.x8664.%version%</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
                  <key>chown</key>
                  <array>
                     <dict>
                        <key>path</key>
                        <string>usr</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                     <dict>
                        <key>path</key>
                        <string>usr/local</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                     <dict>
                        <key>path</key>
                        <string>usr/local/bin</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                     <dict>
                        <key>path</key>
                        <string>usr/local/bin/jq</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                        <key>mode</key>
                        <string>0755</string>
                     </dict>
                  </array>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/AppleSilicon/pkgroot</string>
               <key>pkgdirs</key>
               <dict>
                  <key>usr</key>
                  <string>0755</string>
                  <key>usr/local</key>
                  <string>0755</string>
                  <key>usr/local/bin</key>
                  <string>0755</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/downloads/*jq-macos-arm64</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
               <key>source_path</key>
               <string>%found_filename%</string>
               <key>destination_path</key>
               <string>%pkgroot%/usr/local/bin/jq</string>
               <key>overwrite</key>
               <true />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_request</key>
               <dict>
                  <key>pkgname</key>
                  <string>%VENDOR%-%SOFTWARETITLE%-ARM64-%version%</string>
                  <key>version</key>
                  <string>%version%</string>
                  <key>id</key>
                  <string>org.jqlang.jq.arm64.%version%</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
                  <key>chown</key>
                  <array>
                     <dict>
                        <key>path</key>
                        <string>usr</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                     <dict>
                        <key>path</key>
                        <string>usr/local</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                     <dict>
                        <key>path</key>
                        <string>usr/local/bin</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                     <dict>
                        <key>path</key>
                        <string>usr/local/bin/jq</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                        <key>mode</key>
                        <string>0755</string>
                     </dict>
                  </array>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/Universal/Scripts</string>
               <key>pkgdirs</key>
               <dict />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/Universal/pkgroot</string>
               <key>pkgdirs</key>
               <dict />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
               <key>source</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%-%SOFTWARETITLE%-ARM64-%version%.pkg</string>
               <key>target</key>
               <string>%RECIPE_CACHE_DIR%/Universal/Scripts/%VENDOR%-%SOFTWARETITLE%-ARM64-%version%.pkg</string>
               <key>overwrite</key>
               <false />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
               <key>source</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%-%SOFTWARETITLE%-x8664-%version%.pkg</string>
               <key>target</key>
               <string>%RECIPE_CACHE_DIR%/Universal/Scripts/%VENDOR%-%SOFTWARETITLE%-x8664-%version%.pkg</string>
               <key>overwrite</key>
               <false />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
               <key>file_path</key>
               <string>%RECIPE_CACHE_DIR%/Universal/Scripts/preinstall</string>
               <key>file_mode</key>
               <string>0755</string>
               <key>file_content</key>
               <string>#!/bin/bash

# Determine working directory

installDir=$(dirname $0)

# Identify installer package names

Intel_package="%VENDOR%-%SOFTWARETITLE%-x8664-%version%.pkg"
Apple_Silicon_package="%VENDOR%-%SOFTWARETITLE%-ARM64-%version%.pkg"

# Determine if this Mac has an Intel or Apple Silicon processor

processor=$(/usr/sbin/sysctl -n machdep.cpu.brand_string | grep -o "Intel")

if [[ -n "$processor" ]]; then

/usr/sbin/installer -pkg "$Intel_package" -target "$3"

else

/usr/sbin/installer -pkg "$Apple_Silicon_package" -target "$3"

fi

exit 0</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_request</key>
               <dict>
                  <key>pkgname</key>
                  <string>%VENDOR%-%SOFTWARETITLE%-Universal-%version%</string>
                  <key>version</key>
                  <string>%version%</string>
                  <key>id</key>
                  <string>org.jqlang.jq.universal.%version%</string>
                  <key>scripts</key>
                  <string>%RECIPE_CACHE_DIR%/Universal/Scripts</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/Intel</string>
                  <string>%RECIPE_CACHE_DIR%/AppleSilicon</string>
                  <string>%RECIPE_CACHE_DIR%/Universal</string>
               </array>
            </dict>
         </dict>
      </array>
   </dict>
</plist>