<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Slack installer package for Apple Silicon Macs.</string>
	<key>Identifier</key>
	<string>com.github.rtrouton.download.SlackAppleSilicon</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Slack</string>
		<key>SOFTWARETITLE</key>
		<string>Slack</string>
		<key>ARCHITECTURE</key>
		<string>arm64</string>
		<key>DOWNLOAD_URL</key>
		<string>https://slack.com/api/desktop.latestRelease?platform=mac&amp;arch=%ARCHITECTURE%&amp;variant=pkg&amp;redirect=true</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%SOFTWARETITLE%-AppleSilicon.pkg</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%pathname%</string>
               <key>expected_authority_names</key>
               <array>
                  <string>Developer ID Installer: SLACK TECHNOLOGIES L.L.C. (BQR82RBBHL)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
               </array>
            </dict>
         </dict>
	</array>
</dict>
</plist>
