<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of VMware Tools and extracts the installer package.</string>
        <key>Identifier</key>
        <string>com.github.rtrouton.pkg.VMwareTools</string>
        <key>Input</key>
        <dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4</string>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.download.VMwareTools</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.iso/Install VMware Tools.app</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-app/Contents/Resources/VMware Tools.pkg</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                        <string>%RECIPE_CACHE_DIR%/%NAME%-app</string>
                        <string>%RECIPE_CACHE_DIR%/%NAME%-untar</string>
                        <string>%RECIPE_CACHE_DIR%/%NAME%.iso</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
