<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads VMware Darwin ISO. Adapted from Jesse Peterson's VMwareTools.munki recipe</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.VMwareTools</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>VMwareTools</string>
         <key>DOWNLOAD_URL</key>
         <string>https://packages-prod.broadcom.com/tools/frozen/darwin</string>
         <key>DOWNLOAD_FILE</key>
         <string>darwin.iso</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.4</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
               <key>url</key>
               <string>%DOWNLOAD_URL%/%DOWNLOAD_FILE%</string>
               <key>filename</key>
               <string>%DOWNLOAD_FILE%</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
      </array>
   </dict>
</plist>