<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release of Apple Container from the Container release page on Github: https://github.com/apple/container/releases</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.AppleContainer</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Apple Container</string>
         <key>VENDOR</key>
         <string>Apple</string>
         <key>SOFTWARETITLE</key>
         <string>Container</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
               <key>asset_regex</key>
               <string>container-[\S]+\-signed.pkg</string>
               <key>github_repo</key>
               <string>apple/container</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
      </array>
   </dict>
</plist>