<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>These recipes have moved into autopkg-recipes, and these are now deprecated.</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.download.AutoPkg-Release</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AutoPkg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>These recipes have moved into autopkg-recipes, and the identifiers have changed. Please update your overrides!</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
