<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest Microsoft Teams installer pkg.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.microsoftteams</string>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Microsoft Teams</string>
         <key>VENDOR</key>
         <string>Microsoft</string>
         <key>SOFTWARETITLE</key>
         <string>Teams</string>
      </dict>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>filename</key>
               <string>0409TEAMS21-chk.plist</string>
               <key>download_dir</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%</string>
               <key>url</key>
               <string>https://officecdnmac.microsoft.com/pr/C1297A47-86C4-4C1F-97FA-950631F94777/MacAutoupdate/0409TEAMS21-chk.xml</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>info_path</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%/0409TEAMS21-chk.plist</string>
               <key>plist_keys</key>
               <dict>
                  <key>Update Version</key>
                  <string>DOWNLOAD_VERSION</string>
               </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>filename</key>
               <string>%VENDOR%_%SOFTWARETITLE%.pkg</string>
                <key>download_dir</key>
                <string>%RECIPE_CACHE_DIR%/downloads</string>
               <key>url</key>
               <string>https://statics.teams.cdn.office.net/production-osx/%DOWNLOAD_VERSION%/MicrosoftTeams.pkg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>expected_authority_names</key>
               <array>
                  <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
               </array>
               <key>input_path</key>
               <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/%VENDOR%</string>
               </array>
            </dict>
         </dict>
      </array>
   </dict>
</plist>