<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Uses parent pkg recipe to download the latest Jabra Direct installer package and import it into the Jamf Pro server.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.jamf.jabradirect</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Jabra Direct</string>
         <key>CATEGORY</key>
         <string>Apps</string>
         <key>PKG_CATEGORY</key>
         <string>%CATEGORY%</string>
         <key>STOPPROCESSINGIF_PREDICATE</key>
         <string>download_changed == FALSE</string>
      </dict>
      <key>MinimumVersion</key>
      <string>2.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.rtrouton.pkg.jabradirect</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>category_name</key>
               <string>%CATEGORY%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>%STOPPROCESSINGIF_PREDICATE%</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pkg_category</key>
               <string>%PKG_CATEGORY%</string>
               <key>pkg_notes</key>
               <string>%NAME% %version% installer uploaded via AutoPkg.</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
         </dict>
      </array>
   </dict>
</plist>