<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release version of Busylight for Microsoft Teams for macOS.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.Busylight4MSTeams</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Busylight4MSTeams</string>
         <key>VENDOR</key>
         <string>Plenom</string>
         <key>SOFTWARETITLE1</key>
         <string>Busylight</string>
         <key>SOFTWARETITLE2</key>
         <string>for</string>
         <key>SOFTWARETITLE3</key>
         <string>Microsoft</string>
         <key>SOFTWARETITLE4</key>
         <string>Teams</string>
         <key>DOWNLOADURL</key>
         <string>https://www.plenom.com/download/154724</string>
		 <key>DOWNLOAD_USERAGENT</key>
		 <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 14_7_5) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.4 Safari/605.1.15</string>
	   </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
               <key>url</key>
               <string>%DOWNLOADURL%</string>
               <key>filename</key>
               <string>%VENDOR%-%SOFTWARETITLE1%-%SOFTWARETITLE2%-%SOFTWARETITLE3%-%SOFTWARETITLE4%.zip</string>
			   <key>request-headers</key>
			   <dict>
				   <key>user-agent</key>
				   <string>%DOWNLOAD_USERAGENT%</string>
			   </dict>
		   </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
               <key>archive_path</key>
               <string>%pathname%</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%</string>
               <key>purge_destination</key>
               <true />
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%/*.pkg</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>flat_pkg_path</key>
               <string>%found_filename%</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/unpack/*.pkg</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pkg_payload_path</key>
               <string>%found_filename%/Payload</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>info_path</key>
               <string>%RECIPE_CACHE_DIR%/payload/Busylight4MSTeams.app/Contents/Info.plist</string>
               <key>plist_keys</key>
               <dict>
                  <key>CFBundleVersion</key>
                  <string>minor_version</string>
                  <key>CFBundleShortVersionString</key>
                  <string>major_version</string>
               </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%/*.pkg</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%found_filename%</string>
               <key>expected_authority_names</key>
               <array>
                  <string>Developer ID Installer: Plenom AS (W6YR3EA54F)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
               </array>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/payload</string>
                  <string>%RECIPE_CACHE_DIR%/unpack</string>
               </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
            <key>Arguments</key>
            <dict>
               <key>version</key>
               <string>%major_version%.%minor_version%</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>