<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Processes a pre-downloaded Zscaler installation zip for macOS. Provide the path to the zip to AutoPkg with the -p switch, for example: `autopkg run Zscaler.download -p ~/Downloads/Zscaler-1.2.3.zip`</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.download.zscaler</string>
    <key>Input</key>
    <dict>
		<key>NAME</key>
		<string>Zscaler</string>
		<key>VENDOR</key>
		<string>Zscaler</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
		<key>Processor</key>
		<string>PackageRequired</string>
	</dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%PKG%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%VENDOR%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/%VENDOR%/Zscaler-osx-*-installer.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%found_filename%</string>
                <key>requirement</key>
                <string>identifier "com.zscaler.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PCBCQZJ7S7</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
