<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release version of Logitech's Logi OptionsPlus offline installer.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.LogiOptionsPlusOffline</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Logi OptionsPlus Offline</string>
         <key>VENDOR</key>
         <string>Logitech</string>
         <key>DOWNLOAD_URL</key>
         <string>https://download01.logi.com/web/ftp/pub/techsupport/optionsplus/logioptionsplus_installer_offline.zip</string>
         <key>SOFTWARETITLE1</key>
         <string>Logi</string>
         <key>SOFTWARETITLE2</key>
         <string>OptionsPlus</string>
         <key>SOFTWARETITLE3</key>
         <string>Offline</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
               <key>url</key>
               <string>%DOWNLOAD_URL%</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
               <key>archive_path</key>
               <string>%pathname%</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%</string>
               <key>purge_destination</key>
               <true />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%/*.app</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%found_filename%</string>
               <key>requirement</key>
               <string>identifier "com.logi.optionsplus.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QED4VVPZWA</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
               <key>info_path</key>
               <string>%found_filename%/Contents/Info.plist</string>
               <key>plist_keys</key>
               <dict>
                  <key>CFBundleVersion</key>
                  <string>version</string>
                  <key>CFBundleIdentifier</key>
                  <string>BUNDLE_ID</string>
               </dict>
            </dict>
         </dict>
      </array>
   </dict>
</plist>
