<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest Microsoft OneDrive installer pkg for both Intel and Apple Silicon Macs.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.microsoftuniversalonedrive</string>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Microsoft OneDrive</string>
         <key>VENDOR</key>
         <string>Microsoft</string>
         <key>SOFTWARETITLE</key>
         <string>OneDrive</string>
         <key>PRODUCTID</key>
         <string>2188758</string>
         <key>DOWNLOADURL</key>
         <string>https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%</string>
      </dict>
      <key>Process</key>
      <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The com.github.rtrouton.microsoftonedrive recipes, which previously received only the Intel version of OneDrive, now receive the Universal version of OneDrive. The com.github.rtrouton.microsoftuniversalonedrive recipes still work, but they are now deprecated and will be removed by August 1, 2022. Please update to use the the com.github.rtrouton.microsoftonedrive recipes.</string>
            </dict>
        </dict>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
               <key>url</key>
               <string>%DOWNLOADURL%</string>
               <key>filename</key>
               <string>%SOFTWARETITLE%.pkg</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%pathname%</string>
               <key>expected_authority_names</key>
               <array>
                  <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
               </array>
            </dict>
         </dict>
      </array>
   </dict>
</plist>