<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of both the Microsoft OneDrive installers for Intel and Apple Silicon and builds an installer package which installs the correct OneDrive for the relevant Mac processor and installs it.</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.install.microsoftuniversalonedrive</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Microsoft OneDrive</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.microsoftuniversalonedrive</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>