<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of VMware Fusion 11 and creates a package</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.pkg.VMwareFusion11</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VMwareFusion11</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.5</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.download.VMwareFusion11</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/VMWare Fusion.app</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                    <key>CFBundleIdentifier</key>
                    <string>bundleid</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Scripts</string>
                <key>pkgdirs</key>
                <dict/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/NoPayload</string>
                <key>pkgdirs</key>
                <dict/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
            <string>#!/bin/bash
#
# Pinched with &lt;3 from: https://github.com/autopkg/justinrummel-recipes/blob/42bc13881fe373f771cefec20a53d7844172019f/VMware%20Fusion/VMwareFusion.pkg.munki.recipe
#

VMWARE_FUSION_INSTALLER=$(/bin/ls "${0%/*}"/*vmware*.zip | /usr/bin/head -1)

if [[ -f "$VMWARE_FUSION_INSTALLER" ]]; then
    echo "$VMWARE_FUSION_INSTALLER found."
    
    if [[ -x "$3/Applications/VMware Fusion.app" ]]; then
       rm -rf "$3/Applications/VMware Fusion.app"
    fi

    /usr/bin/ditto -x -k  "$VMWARE_FUSION_INSTALLER" "$3/Applications"

    if [[ -x "$3/Applications/payload/VMware Fusion.app" ]]; then
       /bin/mv "$3/Applications/payload/VMware Fusion.app" "$3/Applications/VMware Fusion.app"
       /bin/rm -rf "$3/Applications/payload"
    fi

    if [[ -e "$3/Applications/VMware Fusion.app" ]]; then
       /usr/sbin/chown -R root:wheel "$3/Applications/VMware Fusion.app"
       /bin/chmod -R 755 "$3/Applications/VMware Fusion.app"
    fi
fi

if [ -e /Applications/VMware\ Fusion.app/Contents/Library/Initialize\ VMware\ Fusion.tool ]
then
        /Applications/VMware\ Fusion.app/Contents/Library/Initialize\ VMware\ Fusion.tool set
fi</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/tar/com.vmware.fusion.zip</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/com.vmware.fusion.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/NoPayload</string>
                    <key>scripts</key>
                    <string>Scripts</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
                    <string>%RECIPE_CACHE_DIR%/Scripts/</string>
                    <string>%RECIPE_CACHE_DIR%/tar/</string>
                    <string>%RECIPE_CACHE_DIR%/source/</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
