<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest version of EndNote 2025 for Mac</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.EndNote2025</string>
      <key>Input</key>
      <dict>
         <key>DOWNLOAD_URL</key>
         <string>https://download.endnote.com/downloads/2025/EndNote2025Installer.dmg</string>
         <key>NAME</key>
         <string>EndNote 2025</string>
         <key>SOFTWARETITLE1</key>
         <string>EndNote</string>
         <key>SOFTWARETITLE2</key>
         <string>2025</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>filename</key>
               <string>%SOFTWARETITLE1%%SOFTWARETITLE2%.dmg</string>
               <key>url</key>
               <string>%DOWNLOAD_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>input_plist_path</key>
               <string>%pathname%/Install EndNote 2025.app/Contents/Info.plist</string>
               <key>plist_version_key</key>
               <string>CFBundleShortVersionString</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%pathname%/Install EndNote 2025.app</string>
               <key>requirement</key>
               <string>anchor apple generic and identifier "com.ThomsonResearchSoft.EndNote.Installer" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2Y4P62NL52")</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>