<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads latest EndNote 2025 installer and uses it to create a package.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.pkg.EndNote2025</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>EndNote 2025</string>
         <key>SOFTWARETITLE1</key>
         <string>EndNote</string>
         <key>SOFTWARETITLE2</key>
         <string>2025</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.rtrouton.download.EndNote2025</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>source_path</key>
               <string>%pathname%/Install EndNote 2025.app/Contents/Resources/EndNote.zip</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/EndNote.zip</string>
               <key>purge_destination</key>
               <true />
            </dict>
            <key>Processor</key>
            <string>Copier</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>archive_path</key>
               <string>%RECIPE_CACHE_DIR%/EndNote.zip</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/unarchive</string>
               <key>purge_destination</key>
               <true />
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>input_plist_path</key>
               <string>%RECIPE_CACHE_DIR%/unarchive/EndNote/EndNote 2025.app/Contents/Info.plist</string>
               <key>plist_version_key</key>
               <string>CFBundleShortVersionString</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pkgdirs</key>
               <dict>
                  <key>Applications</key>
                  <string>0775</string>
               </dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/EndNote 2025</string>
               <key>source_path</key>
               <string>%RECIPE_CACHE_DIR%/unarchive/EndNote</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pkg_request</key>
               <dict>
                  <key>chown</key>
                  <array>
                     <dict>
                        <key>group</key>
                        <string>admin</string>
                        <key>path</key>
                        <string>Applications</string>
                        <key>user</key>
                        <string>root</string>
                     </dict>
                  </array>
                  <key>id</key>
                  <string>com.endnote.EndNote2025.pkg</string>
                  <key>pkgname</key>
                  <string>%SOFTWARETITLE1%%SOFTWARETITLE2%-%version%</string>
                  <key>pkgroot</key>
                  <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                  <key>pkgtype</key>
                  <string>flat</string>
                  <key>version</key>
                  <string>%version%</string>
               </dict>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/EndNote.zip</string>
                  <string>%RECIPE_CACHE_DIR%/unarchive</string>
                  <string>%RECIPE_CACHE_DIR%/pkgroot</string>
               </array>
            </dict>
         </dict>
      </array>
   </dict>
</plist>