<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release of SapMachine Java 17 JDK for Intel from the SapMachine release page on Github: https://github.com/SAP/SapMachine/releases</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.SapMachineIntelJDK17</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>SapMachine</string>
         <key>VENDOR</key>
         <string>SAP</string>
         <key>SOFTWARETITLE</key>
         <string>SapMachine</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
               <key>asset_regex</key>
               <string>sapmachine-jdk-17[\S]macos-x64_bin.dmg</string>
               <key>github_repo</key>
               <string>sap/sapmachine</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
      </array>
   </dict>
</plist>