<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release of UTM Guest Tools for macOS and renames the installer package.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.pkg.UTMGuestTools</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>UTM Guest Tools</string>
         <key>VENDOR</key>
         <string>UTM</string>
         <key>SOFTWARETITLE1</key>
         <string>Guest</string>
         <key>SOFTWARETITLE2</key>
         <string>Tools</string>
      </dict>
      <key>ParentRecipe</key>
      <string>com.github.rtrouton.download.UTMGuestTools</string>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
               <key>source_pkg</key>
               <string>%pathname%</string>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%-%SOFTWARETITLE1%-%SOFTWARETITLE2%-%version%.pkg</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>