<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release of UTM Guest Tools for macOS from Github: https://github.com/utmapp/vd_agent/releases</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.UTMGuestTools</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>UTM Guest Tools</string>
         <key>VENDOR</key>
         <string>UTM</string>
         <key>SOFTWARETITLE1</key>
         <string>Guest</string>
         <key>SOFTWARETITLE2</key>
         <string>Tools</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
               <key>asset_regex</key>
               <string>spice-vdagent[\S]+\.pkg</string>
               <key>github_repo</key>
               <string>utmapp/vd_agent</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%pathname%</string>
               <key>expected_authority_names</key>
               <array>
                  <string>Developer ID Installer: Turing Software, LLC (WDNLXAD4W8)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
               </array>
            </dict>
         </dict>
      </array>
   </dict>
</plist>