<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest RStudio disk image and builds a package. The installer package includes a preinstall script that will check for an existing RStudio.app in /Applications and remove it if found.</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.pkg.RStudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RStudio</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.download.RStudio</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>split_on</key>
				<string>+</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
    </array>
</dict>
</plist>
