<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest OpenJDK 12 for macOS.</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.download.OpenJDK12</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OpenJDK 12</string>
        <key>VENDOR</key>
        <string>OpenJDK</string>
        <key>SOFTWARETITLE</key>
        <string>Java</string>
        <key>SOFTWARETYPE</key>
        <string>JDK</string>
        <key>SEARCH_URL</key>
        <string>https://jdk.java.net/12/index.html</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;https://download.java.net/java/GA/jdk12.*?/GPL/openjdk-12\.[0-9\.]+_osx-x64_bin\.tar\.gz)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This Java version is no longer publicly available - please see https://jdk.java.net/12/index.html for more information. </string>
            </dict>
        </dict>
        <dict>   
            <key>Processor</key>   
            <string>StopProcessingIf</string>   
            <key>Arguments</key>   
            <dict>   
                <key>predicate</key>   
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>

    </array>
</dict>
</plist>
