<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest Microsoft Outlook installer package for Office 365.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.microsoftoutlook365</string>
      <key>MinimumVersion</key>
      <string>1.4</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Microsoft Outlook</string>
         <key>VENDOR</key>
         <string>Microsoft</string>
         <key>SOFTWARETITLE</key>
         <string>Outlook</string>
      </dict>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>CURLTextSearcher</string>
            <key>Arguments</key>
            <dict>
               <key>url</key>
               <string>https://learn.microsoft.com/en-us/officeupdates/update-history-office-for-mac</string>
               <key>re_pattern</key>
               <string>(https?://officecdn\.microsoft\.com/pr/[^/]+/MacAutoupdate/Microsoft_Outlook_[0-9.]+_Updater\.pkg)</string>
               <key>result_output_var_name</key>
               <string>url</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
               <key>url</key>
               <string>%url%</string>
               <key>filename</key>
               <string>%VENDOR%_%SOFTWARETITLE%.pkg</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%pathname%</string>
               <key>expected_authority_names</key>
               <array>
                  <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
               </array>
            </dict>
         </dict>
      </array>
   </dict>
</plist>