<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Microsoft Defender anti-virus software</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.munki.microsoftdefender</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.microsoftdefender</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MicrosoftDefender</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Microsoft</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Microsoft Defender anti-virus software</string>
            <key>display_name</key>
            <string>Microsoft Defender Anti-Virus</string>
            <key>developer</key>
            <string>Microsoft</string>
            <key>category</key>
            <string>Productivity</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>minimum_os_version</key>
            <string>10.12.0</string>
            <key>uninstall_method</key>
			<string>removepackages</string>
			<key>preuninstall_script</key>
			<string>#!/bin/zsh
# Source: https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-resources?view=o365-worldwide#uninstalling
/Library/Application\ Support/Microsoft/Defender/uninstall/uninstall
exit 0</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/downloads/payload</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Microsoft Defender.app</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
