<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads latest SAP GUI zip file, builds a package and signs it. </string>
      <key>Identifier</key>
      <string>com.github.rtrouton.sign.sapgui</string>
      <key>Input</key>
      <dict>
         <key>SIGNINGCERTIFICATE</key>
         <string>Put_Signing_Certificate_into_AutoPkg_recipe_override</string>
         <key>SIGN_RECIPE_PARENT_RECIPE</key>
         <string>Put_SAPGUI_parent_recipe_identifier_into_AutoPkg_recipe_override</string>
      </dict>
      <key>ParentRecipe</key>
      <string>%SIGN_RECIPE_PARENT_RECIPE%</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>SIGN_RECIPE_PARENT_RECIPE == "Put_SAPGUI_parent_recipe_identifier_into_AutoPkg_recipe_override"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>DOWNLOAD_URL == "Put_Signing_Certificate_into_AutoPkg_recipe_override"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>com.github.rtrouton.SharedProcessors/PkgSigner</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%PACKAGER%_%VENDOR%_%SOFTWARETITLE%_%alphanumeric_version%.pkg</string>
               <key>signing_cert</key>
               <string>%SIGNINGCERTIFICATE%</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>