<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest NexThink Collector uninstaller and prepares it for deployment.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.pkg.NexThinkCollectorUninstaller</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>NexThink Collector Uninstaller</string>
         <key>VENDOR</key>
         <string>NexThink</string>
         <key>SOFTWARETITLE1</key>
         <string>Collector</string>
         <key>SOFTWARETITLE2</key>
         <string>Uninstaller</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.rtrouton.download.NexThinkCollector</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Comment</key>
            <string>Get version from the installer application</string>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
               <key>input_plist_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/%VENDOR%%SOFTWARETITLE%.dmg/csi.app/Contents/Info.plist</string>
               <key>plist_version_key</key>
               <string>CFBundleVersion</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/Scripts</string>
               <key>pkgdirs</key>
               <dict />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/pkgroot</string>
               <key>pkgdirs</key>
               <dict />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
               <key>source_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/%VENDOR%%SOFTWARETITLE%.dmg</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/Scripts/%VENDOR%%SOFTWARETITLE%.dmg</string>
               <key>purge_destination</key>
               <true />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
               <key>file_path</key>
               <string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
               <key>file_mode</key>
               <string>0755</string>
               <key>file_content</key>
               <string>#!/bin/bash

# Description: Script to uninstall Nexthink Collector.

ERROR=0

# File Paths

if [[ -f "$(/usr/bin/find $(dirname $0) -maxdepth 1 \( -iname \*\.dmg \))" ]]; then
   dmgFile="$(/usr/bin/find $(dirname $0) -maxdepth 1 \( -iname \*\.dmg \))"
fi

dmgMount="$(/usr/bin/mktemp -d /tmp/Nexthink_Collector_Uninstaller.XXXX)"

# Remove the trailing slash from the dmgMount variable if needed.
dmgMount=${dmgMount%%/}

# Mount the DMG
/usr/bin/hdiutil attach "$dmgFile" -mountpoint "$dmgMount" -nobrowse -noverify -noautoopen

# Uninstall the NexThink Collector software

# Define the parameters for csi.app for installing the Collector from the command line interface
"$dmgMount"/uninstaller

# Unmount the DMG
hdiutil detach "$dmgMount" -force

exit "$ERROR"</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_request</key>
               <dict>
                  <key>pkgroot</key>
                  <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                  <key>pkgname</key>
                  <string>%VENDOR%_%SOFTWARETITLE1%_%SOFTWARETITLE2%_%version%</string>
                  <key>pkgtype</key>
                  <string>flat</string>
                  <key>id</key>
                  <string>com.nexthink.nexthinkcollector.uninstaller</string>
                  <key>version</key>
                  <string>%version%</string>
                  <key>scripts</key>
                  <string>Scripts</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/Scripts</string>
               </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
         </dict>
      </array>
   </dict>
</plist>