<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MacDown 3000 and installs it.</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.install.MacDown3000</string>
    <key>Input</key>
    <dict>
         <key>NAME</key>
         <string>MacDown 3000</string>
         <key>SOFTWARETITLE1</key>
         <string>MacDown</string>
         <key>SOFTWARETITLE2</key>
         <string>3000</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.MacDown3000</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>