<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest Signing Manager installer pkg.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.signingmanager</string>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Signing Manager</string>
         <key>VENDOR</key>
         <string>Twocanoes</string>
         <key>SOFTWARETITLE1</key>
         <string>Signing</string>
         <key>SOFTWARETITLE2</key>
         <string>Manager</string>
         <key>DOWNLOADURL</key>
         <string>https://tc-downloads.s3.amazonaws.com/Signing_Manager.dmg</string>
      </dict>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
               <key>url</key>
               <string>%DOWNLOADURL%</string>
               <key>filename</key>
               <string>%VENDOR%_%SOFTWARETITLE1%_%SOFTWARETITLE2%.dmg</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%pathname%/Signing Manager.pkg</string>
               <key>expected_authority_names</key>
               <array>
                  <string>Developer ID Installer: Twocanoes Software, Inc. (UXP6YEHSPW)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
               </array>
            </dict>
         </dict>
      </array>
   </dict>
</plist>