<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Amazon Coretto JDK 11 for macOS on Intel.</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.download.amazoncorettojdk11</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Amazon Coretto JDK 11</string>
        <key>VENDOR</key>
        <string>Amazon</string>
        <key>DISTRIBUTION</key>
        <string>Coretto</string>
        <key>SOFTWARETITLE</key>
        <string>Java</string>
        <key>SOFTWARETYPE</key>
        <string>JDK</string>
        <key>SEARCH_URL</key>
        <string>https://github.com/corretto/corretto-11/releases/latest</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;https.*?corretto.*?\-macosx-x64.pkg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>amazon-corretto-(?P&lt;version&gt;.*?)-macosx-x64.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
         <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%pathname%</string>
               <key>expected_authority_names</key>
               <array>
                  <string>Developer ID Installer: AMZN Mobile LLC (94KV3E626L)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
               </array>
            </dict>
         </dict>
    </array>
</dict>
</plist>