<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Open JavaFX SDK for macOS.</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.download.OpenJavaFX</string>
    <key>Input</key>
    <dict>
         <key>NAME</key>
         <string>OpenJavaFX</string>
         <key>VENDOR</key>
         <string>OpenJFX</string>
         <key>SOFTWARETITLE</key>
         <string>JavaFX</string>
        <key>SEARCH_URL</key>
        <string>https://gluonhq.com/products/javafx</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;http://gluonhq.com/download/javafx-[\S]+sdk-mac)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>javafx-sdk-mac.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>