<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release version of Microsoft OpenJDK JDK 11 for Apple Silicon macOS and renames the package.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.pkg.microsoftapplesiliconopenjdk11</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Microsoft OpenJDK JDK 11</string>
         <key>VENDOR</key>
         <string>Microsoft</string>
         <key>DISTRIBUTION</key>
         <string>OpenJDK</string>
         <key>SOFTWARETITLE</key>
         <string>Java</string>
         <key>SOFTWARETYPE</key>
         <string>JDK</string>
         <key>PROCESSORTYPE</key>
         <string>AppleSilicon</string>
         <key>MAJORVERSION</key>
         <string>11</string>
         <key>VERSIONTYPE</key>
         <string>CFBundleShortVersionString</string>
      </dict>
      <key>ParentRecipe</key>
      <string>com.github.rtrouton.download.microsoftapplesiliconopenjdk11</string>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/unpack</string>
               <key>flat_pkg_path</key>
               <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/unpack/com.microsoft.11.jdk.pkg</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/payload</string>
               <key>pkg_payload_path</key>
               <string>%found_filename%/Payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>input_plist_path</key>
               <string>%RECIPE_CACHE_DIR%/payload/Library/Java/JavaVirtualMachines/microsoft-11.jdk/Contents/Info.plist</string>
               <key>plist_version_key</key>
               <string>%VERSIONTYPE%</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
               <key>source_pkg</key>
               <string>%pathname%</string>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%_%DISTRIBUTION%_%MAJORVERSION%_%SOFTWARETITLE%_%SOFTWARETYPE%_%PROCESSORTYPE%_%version%.pkg</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/unpack</string>
                  <string>%RECIPE_CACHE_DIR%/payload</string>
               </array>
            </dict>
         </dict>
      </array>
   </dict>
</plist>