<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release of Notepad++ for macOS from Github: https://github.com/notepad-plus-plus-mac/notepad-plus-plus-macos/releases</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.download.NotepadPlusPlus</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Notepad Plus Plus</string>
         <key>SOFTWARETITLE1</key>
         <string>Notepad</string>
         <key>SOFTWARETITLE2</key>
         <string>Plus</string>
         <key>SOFTWARETITLE3</key>
         <string>Plus</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
               <key>asset_regex</key>
               <string>Notepad[\S]+\.dmg</string>
               <key>github_repo</key>
               <string>notepad-plus-plus-mac/notepad-plus-plus-macos</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%pathname%/Notepad++.app</string>
               <key>requirement</key>
               <string>identifier "org.notepadplusplus.mac" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = S5972U9P85</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>