<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current Jamf Protect uninstaller, extracts version information and renames the installer package.</string>
	<key>Identifier</key>
	<string>com.github.rtrouton.pkg.uninstaller.jamfprotect</string>
	<key>Input</key>
	<dict>
        <key>NAME</key>
        <string>Jamf Protect</string>
        <key>VENDOR</key>
        <string>Jamf</string>
        <key>SOFTWARETITLE1</key>
        <string>Protect</string>
        <key>SOFTWARETITLE2</key>
        <string>Uninstaller</string>
        <key>PACKAGENAME</key>
        <string>%VENDOR%_%SOFTWARETITLE1%_%SOFTWARETITLE2%_</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.download.uninstaller.jamfprotect</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.dataJAR-recipes.Shared Processors/DistributionPkgInfo</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%PACKAGENAME%%version%.pkg</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>